# print('Hello world')
# print("Syimyk")

print("Hello world", 5, '5', "Adelina")

# qwerty


"Арифметическсие действия"

'Арифметическсие действия'

"""
Арифметическсие 
действия
"""

'''
Арифметическсие 
действия
'''

# print("Арифметическсие действия")

# print(4 + 5) # 9
# print(12 - 6) # 6

# print("4 + 5 =", 4 + 5)
# print("10 - 5 =", 10 - 5)

# print(2+2) 
# print(2-2)

# print(6*2) 
# print(6**2) 
# print(6**5) 

# print(7/2) # 3.0
# print(7//2) # 3
# print(7%2) # 1


# print(7>2)
# print(7<2)

"""
= - знак присваивания
== - знак сравнения
!= - знак не равно
"""
# print(7==7)
# print(7!=2) 

"""
>= - больше или равно
"""

print(7>=45)
print(7<=45)


"CTRL + Ё - Вызвать терминал"

